Rayleigh-Taylor-DES/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------*\
| =========                 |                                                |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox         |
|  \\    /   O peration     | Version:  v2412                               |
|   \\  /    A nd           | Web:      www.openfoam.com                    |
|    \\/     M anipulation  |                                                |
\*-----------------------------------------------------------------------*/
// AUTO-GENERATED by system/makeBlockMeshDict.py -- do not hand-edit.
// Regenerate with: python3 system/makeBlockMeshDict.py
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0.000000 0.000000 0.000000) // 0
    (0.150000 0.000000 0.000000) // 1
    (0.150000 0.600000 0.000000) // 2
    (0.000000 0.600000 0.000000) // 3
    (0.000000 0.000000 0.075000) // 4
    (0.150000 0.000000 0.075000) // 5
    (0.150000 0.600000 0.075000) // 6
    (0.000000 0.600000 0.075000) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 160 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    bottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    top
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    left
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type wall;
        faces
        (
            (1 2 6 5)
        );
    }
    front
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    back
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
