Rayleigh-Taylor-DES/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       373600;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       374400;
    }
    left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3200;
        startFace       375200;
    }
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3200;
        startFace       378400;
    }
    front
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6400;
        startFace       381600;
    }
    back
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6400;
        startFace       388000;
    }
)

// ************************************************************************* //
