Rayleigh-Taylor-DES/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------*\
| =========                 |                                                |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox         |
|  \\    /   O peration     | Version:  v2412                               |
|   \\  /    A nd           | Web:      www.openfoam.com                    |
|    \\/     M anipulation  |                                                |
\*-----------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  LES;

LES
{
    LESModel        kOmegaSSTIDDES;

    turbulence      on;
    printCoeffs     on;

    delta           IDDESDelta;
    
    IDDESDeltaCoeffs
    {
    }
}

// ************************************************************************* //
