Rayleigh-Taylor-DES/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------*\
| =========                 |                                                |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox         |
|  \\    /   O peration     | Version:  v2412                               |
|   \\  /    A nd           | Web:      www.openfoam.com                    |
|    \\/     M anipulation  |                                                |
\*-----------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (heavy light);

heavy
{
    transportModel  Newtonian;
    nu              1e-06;
    rho             1000;
}

light
{
    transportModel  Newtonian;
    nu              1.48e-05;
    rho             111.111;
}

sigma           0.03;

// ************************************************************************* //
