Rayleigh-Taylor-DES/0/alpha.heavy
/*--------------------------------*- C++ -*----------------------------*\
| =========                 |                                                |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox         |
|  \\    /   O peration     | Version:  v2412                               |
|   \\  /    A nd           | Web:      www.openfoam.com                    |
|    \\/     M anipulation  |                                                |
\*-----------------------------------------------------------------------*/
// AUTO-GENERATED by system/makeAlphaField.py -- do not hand-edit the
// internalField below. Regenerate with: python3 system/makeAlphaField.py
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.heavy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar>
128000
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    bottom  { type zeroGradient; }
    top     { type zeroGradient; }
    left    { type zeroGradient; }
    right   { type zeroGradient; }
    front   { type zeroGradient; }
    back    { type zeroGradient; }
}

// ************************************************************************* //
