Rayleigh-Taylor-DES/0/nut
/*--------------------------------*- C++ -*----------------------------*\
| =========                 |                                                |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox         |
|  \\    /   O peration     | Version:  v2412                               |
|   \\  /    A nd           | Web:      www.openfoam.com                    |
|    \\/     M anipulation  |                                                |
\*-----------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-6;

boundaryField
{
    bottom  { type nutkWallFunction; value uniform 0; }
    top     { type nutkWallFunction; value uniform 0; }
    left    { type nutkWallFunction; value uniform 0; }
    right   { type nutkWallFunction; value uniform 0; }
    front   { type nutkWallFunction; value uniform 0; }
    back    { type nutkWallFunction; value uniform 0; }
}

// ************************************************************************* //
